Repository: mkaraivanov/base-ai-project
Catalog: Backend/Resources/SharedResource.*.resx
Languages: bg

source: Address is required
bg: Адресът е задължителен

source: Address must not exceed 200 characters
bg: Адресът не трябва да надвишава 200 знака

source: At least one seat must be defined
bg: Трябва да бъде дефинирано поне едно място

source: At least one seat must be selected
bg: Трябва да бъде избрано поне едно място

source: Base price must be greater than 0
bg: Базовата цена трябва да бъде по-голяма от 0

source: Base price must not exceed 1000
bg: Базовата цена не трябва да надвишава 1000

source: CVV is required
bg: CVV е задължителен

source: CVV must be 3 or 4 digits
bg: CVV трябва да бъде 3 или 4 цифри

source: Cannot reserve more than 10 seats at once
bg: Не може да се резервират повече от 10 места наведнъж

source: Card holder name is required
bg: Името на картодържателя е задължително

source: Card holder name must not exceed 100 characters
bg: Името на картодържателя не трябва да надвишава 100 знака

source: Card number is required
bg: Номерът на картата е задължителен

source: Card number must be between 13 and 19 digits
bg: Номерът на картата трябва да бъде между 13 и 19 цифри

source: Cinema Hall ID is required
bg: ID на киносалона е задължително

source: Cinema is required
bg: Киното е задължително

source: Cinema name is required
bg: Името на киното е задължително

source: Cinema name must not exceed 100 characters
bg: Името на киното не трябва да надвишава 100 знака

source: City is required
bg: Градът е задължителен

source: City must not exceed 100 characters
bg: Градът не трябва да надвишава 100 знака

source: Country is required
bg: Страната е задължителна

source: Country must not exceed 100 characters
bg: Страната не трябва да надвишава 100 знака

source: Description is required
bg: Описанието е задължително

source: Description must not exceed 2000 characters
bg: Описанието не трябва да надвишава 2000 знака

source: Duplicate seat numbers are not allowed
bg: Дублиращи се номера на места не са разрешени

source: Duration must be greater than 0
bg: Продължителността трябва да бъде по-голяма от 0

source: Duration must not exceed 500 minutes
bg: Продължителността не трябва да надвишава 500 минути

source: Email is required
bg: Имейлът е задължителен

source: Email must not exceed 200 characters
bg: Имейлът не трябва да надвишава 200 знака

source: Expiry date is required
bg: Датата на изтичане е задължителна

source: Expiry date must be in MM/YY format
bg: Датата на изтичане трябва да бъде в формат MM/YY

source: First name is required
bg: Името е задължително

source: First name must not exceed 100 characters
bg: Името не трябва да надвишава 100 знака

source: Genre is required
bg: Жанрът е задължителен

source: Genre must not exceed 50 characters
bg: Жанрът не трябва да надвишава 50 знака

source: Hall name is required
bg: Името на залата е задължително

source: Hall name must not exceed 100 characters
bg: Името на залата не трябва да надвишава 100 знака

source: Invalid email address format
bg: Невалиден формат на имейл адрес

source: Invalid email format
bg: Невалиден формат на имейл

source: Invalid phone number format
bg: Невалиден формат на телефонен номер

source: Invalid seat number format (e.g., A1, B12)
bg: Невалиден формат на номер на място (напр. A1, B12)

source: Last name is required
bg: Фамилното име е задължително

source: Last name must not exceed 100 characters
bg: Фамилното име не трябва да надвишава 100 знака

source: Logo URL must not exceed 500 characters
bg: URL на логото не трябва да надвишава 500 знака

source: Movie ID is required
bg: ID на филма е задължително

source: Password is required
bg: Паролата е задължителна

source: Password must be at least 8 characters
bg: Паролата трябва да бъде поне 8 знака

source: Password must contain at least one lowercase letter
bg: Паролата трябва да съдържа поне една малка буква

source: Password must contain at least one number
bg: Паролата трябва да съдържа поне една цифра

source: Password must contain at least one uppercase letter
bg: Паролата трябва да съдържа поне една главна буква

source: Payment method is required
bg: Начинът на плащане е задължителен

source: Payment method must not exceed 50 characters
bg: Начинът на плащане не трябва да надвишава 50 знака

source: Phone number is required
bg: Телефонният номер е задължителен

source: Phone number must not exceed 20 characters
bg: Телефонният номер не трябва да надвишава 20 знака

source: Poster URL is required
bg: URL на постера е задължителен

source: Poster URL must be a valid URL
bg: URL на постера трябва да бъде валиден URL

source: Rating is required
bg: Рейтингът е задължителен

source: Rating must be G, PG, PG-13, R, or NC-17
bg: Рейтингът трябва да бъде G, PG, PG-13, R или NC-17

source: Release date is required
bg: Датата на излизане е задължителна

source: Reservation ID is required
bg: ID на резервацията е задължително

source: Rows must be greater than 0
bg: Редовете трябва да бъдат повече от 0

source: Rows must not exceed 50
bg: Редовете не трябва да надвишават 50

source: Seat layout is required
bg: Наредбата на местата е задължителна

source: Seat number cannot be empty
bg: Номерът на мястото не може да бъде празен

source: Seats list is required
bg: Списъкът с места е задължителен

source: Seats per row must be greater than 0
bg: Местата на ред трябва да бъдат повече от 0

source: Seats per row must not exceed 100
bg: Местата на ред не трябва да надвишават 100

source: Showtime ID is required
bg: ID на прожекцията е задължително

source: Start time is required
bg: Началният час е задължителен

source: Start time must be in the future
bg: Началният час трябва да бъде в бъдещето

source: Ticket type must be specified for each seat
bg: Типът на билета трябва да бъде посочен за всяко място

source: Title is required
bg: Заглавието е задължително

source: Title must not exceed 200 characters
bg: Заглавието не трябва да надвишава 200 знака

source: Validation failed
bg: Валидацията е неуспешна

source: Account is inactive
bg: Акаунтът е неактивен

source: Associated movie not found
bg: Свързаният филм не е намерен

source: Booking cannot be cancelled
bg: Резервацията не може да бъде отменена

source: Booking not found
bg: Резервацията не е намерена

source: Cannot book past or ongoing showtimes
bg: Не може да се резервира за минали или текущи прожекции

source: Cannot cancel a booking within 1 hour of the showtime
bg: Не може да се анулира резервация в рамките на 1 час от прожекцията

source: Cinema hall not found
bg: Киносалонът не е намерен

source: Cinema not found
bg: Киното не е намерено

source: Email already registered
bg: Имейлът вече е регистриран

source: Failed to cancel booking
bg: Неуспешно анулиране на резервацията

source: Failed to cancel reservation
bg: Неуспешно анулиране на резервацията (предварителна)

source: Failed to confirm booking
bg: Неуспешно потвърждение на резервацията

source: Failed to create cinema
bg: Неуспешно създаване на кино

source: Failed to create cinema hall
bg: Неуспешно създаване на киносалон

source: Failed to create movie
bg: Неуспешно създаване на филм

source: Failed to create reservation
bg: Неуспешно създаване на резервация

source: Failed to create showtime
bg: Неуспешно създаване на прожекция

source: Failed to create ticket type
bg: Неуспешно създаване на тип билет

source: Failed to delete cinema
bg: Неуспешно изтриване на кино

source: Failed to delete cinema hall
bg: Неуспешно изтриване на киносалон

source: Failed to delete movie
bg: Неуспешно изтриване на филм

source: Failed to delete showtime
bg: Неуспешно изтриване на прожекция

source: Failed to delete ticket type
bg: Неуспешно изтриване на тип билет

source: Failed to export CSV
bg: Неуспешен износ на CSV

source: Failed to retrieve booking
bg: Неуспешно извличане на резервация

source: Failed to retrieve bookings
bg: Неуспешно извличане на резервации

source: Failed to retrieve cinema
bg: Неуспешно извличане на кино

source: Failed to retrieve cinema hall
bg: Неуспешно извличане на киносалон

source: Failed to retrieve cinema halls
bg: Неуспешно извличане на киносалони

source: Failed to retrieve cinemas
bg: Неуспешно извличане на кина

source: Failed to retrieve loyalty card
bg: Неуспешно извличане на карта за лоялност

source: Failed to retrieve loyalty settings
bg: Неуспешно извличане на настройките за лоялност

source: Failed to retrieve movie
bg: Неуспешно извличане на филм

source: Failed to retrieve movies
bg: Неуспешно извличане на филми

source: Failed to retrieve sales by date report
bg: Неуспешно извличане на отчет за продажби по дата

source: Failed to retrieve sales by location report
bg: Неуспешно извличане на отчет за продажби по местоположение

source: Failed to retrieve sales by movie report
bg: Неуспешно извличане на отчет за продажби по филм

source: Failed to retrieve sales by showtime report
bg: Неуспешно извличане на отчет за продажби по прожекция

source: Failed to retrieve seat availability
bg: Неуспешно извличане на наличност на места

source: Failed to retrieve showtime
bg: Неуспешно извличане на прожекция

source: Failed to retrieve showtimes
bg: Неуспешно извличане на прожекции

source: Failed to retrieve ticket types
bg: Неуспешно извличане на типове билети

source: Failed to update cinema
bg: Неуспешно актуализиране на кино

source: Failed to update cinema hall
bg: Неуспешно актуализиране на киносалон

source: Failed to update loyalty settings
bg: Неуспешно актуализиране на настройките за лоялност

source: Failed to update movie
bg: Неуспешно актуализиране на филм

source: Failed to update showtime
bg: Неуспешно актуализиране на прожекция

source: Failed to update ticket type
bg: Неуспешно актуализиране на тип билет

source: Invalid email or password
bg: Невалиден имейл или парола

source: Login failed. Please try again.
bg: Влизането е неуспешно. Моля, опитайте отново.

source: Movie not found
bg: Филмът не е намерен

source: Payment declined
bg: Плащането е отхвърлено

source: Payment declined by bank
bg: Плащането е отхвърлено от банката

source: Payment processing failed
bg: Обработката на плащането е неуспешна

source: Price modifier must be greater than zero
bg: Ценовият модификатор трябва да бъде по-голям от нула

source: Refund processing failed
bg: Обработката на възстановяването е неуспешна

source: Registration failed. Please try again.
bg: Регистрацията е неуспешна. Моля, опитайте отново.

source: Reservation cannot be cancelled
bg: Резервацията не може да бъде анулирана

source: Reservation has expired
bg: Резервацията е изтекла

source: Reservation is no longer valid
bg: Резервацията вече не е валидна

source: Reservation not found
bg: Резервацията не е намерена

source: Selected seats are no longer available. Please try again.
bg: Избраните места вече не са налични. Моля, опитайте отново.

source: Showtime not found
bg: Прожекцията не е намерена

source: Showtime overlaps with existing showtime in this hall
bg: Прожекцията се застъпва с вече съществуваща прожекция в тази зала

source: Stamps required must be at least 1
bg: Необходимите марки трябва да бъдат поне 1

source: Ticket type not found
bg: Типът на билета не е намерен

source: Unauthorized
bg: Неоторизиран достъп
